zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MC_CGM.h
#define MC_CGM_MUX_0_CSS_SELSTAT_MASK            (0xF000000U)
#define MC_CGM_MUX_0_CSS_SELSTAT_SHIFT           (24U)
/*! SELSTAT - Clock source selection status
 *  0b0000..FIRC
 *  0b1000..PLL_PHI0_CLK
 */
#define MC_CGM_MUX_0_CSS_SELSTAT(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_CSS_SELSTAT_SHIFT)) & MC_CGM_MUX_0_CSS_SELSTAT_MASK)
/*! @} */

/*! @name MUX_0_DC_0 - Clock Mux 0 Divider 0 Control Register */
/*! @{ */

#define MC_CGM_MUX_0_DC_0_DIV_MASK               (0x70000U)
#define MC_CGM_MUX_0_DC_0_DIV_SHIFT              (16U)
/*! DIV - Division value */
#define MC_CGM_MUX_0_DC_0_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DC_0_DIV_SHIFT)) & MC_CGM_MUX_0_DC_0_DIV_MASK)

#define MC_CGM_MUX_0_DC_0_DE_MASK                (0x80000000U)
#define MC_CGM_MUX_0_DC_0_DE_SHIFT               (31U)
/*! DE - Divider enable
 *  0b0..Reserved
 *  0b1..Divider is enabled.
 */
#define MC_CGM_MUX_0_DC_0_DE(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DC_0_DE_SHIFT)) & MC_CGM_MUX_0_DC_0_DE_MASK)
/*! @} */

/*! @name MUX_0_DC_1 - Clock Mux 0 Divider 1 Control Register */
/*! @{ */

#define MC_CGM_MUX_0_DC_1_DIV_MASK               (0x70000U)
#define MC_CGM_MUX_0_DC_1_DIV_SHIFT              (16U)
/*! DIV - Division value */
#define MC_CGM_MUX_0_DC_1_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DC_1_DIV_SHIFT)) & MC_CGM_MUX_0_DC_1_DIV_MASK)

#define MC_CGM_MUX_0_DC_1_DE_MASK                (0x80000000U)
#define MC_CGM_MUX_0_DC_1_DE_SHIFT               (31U)
/*! DE - Divider enable
 *  0b0..Reserved
 *  0b1..Divider is enabled.
 */
#define MC_CGM_MUX_0_DC_1_DE(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DC_1_DE_SHIFT)) & MC_CGM_MUX_0_DC_1_DE_MASK)
/*! @} */

/*! @name MUX_0_DC_2 - Clock Mux 0 Divider 2 Control Register */
/*! @{ */

#define MC_CGM_MUX_0_DC_2_DIV_MASK               (0xF0000U)
#define MC_CGM_MUX_0_DC_2_DIV_SHIFT              (16U)
/*! DIV - Division value */
#define MC_CGM_MUX_0_DC_2_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DC_2_DIV_SHIFT)) & MC_CGM_MUX_0_DC_2_DIV_MASK)

#define MC_CGM_MUX_0_DC_2_DE_MASK                (0x80000000U)
#define MC_CGM_MUX_0_DC_2_DE_SHIFT               (31U)
/*! DE - Divider enable
 *  0b0..Reserved
 *  0b1..Divider is enabled.
 */
#define MC_CGM_MUX_0_DC_2_DE(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DC_2_DE_SHIFT)) & MC_CGM_MUX_0_DC_2_DE_MASK)
/*! @} */

/*! @name MUX_0_DC_3 - Clock Mux 0 Divider 3 Control Register */
/*! @{ */

#define MC_CGM_MUX_0_DC_3_DIV_MASK               (0x70000U)
#define MC_CGM_MUX_0_DC_3_DIV_SHIFT              (16U)
/*! DIV - Division value */
#define MC_CGM_MUX_0_DC_3_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DC_3_DIV_SHIFT)) & MC_CGM_MUX_0_DC_3_DIV_MASK)

#define MC_CGM_MUX_0_DC_3_DE_MASK                (0x80000000U)
#define MC_CGM_MUX_0_DC_3_DE_SHIFT               (31U)
/*! DE - Divider enable
 *  0b0..Reserved
 *  0b1..Divider is enabled.
 */
#define MC_CGM_MUX_0_DC_3_DE(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DC_3_DE_SHIFT)) & MC_CGM_MUX_0_DC_3_DE_MASK)
/*! @} */

/*! @name MUX_0_DC_4 - Clock Mux 0 Divider 4 Control Register */
/*! @{ */

#define MC_CGM_MUX_0_DC_4_DIV_MASK               (0x70000U)
#define MC_CGM_MUX_0_DC_4_DIV_SHIFT              (16U)
/*! DIV - Division value */
#define MC_CGM_MUX_0_DC_4_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DC_4_DIV_SHIFT)) & MC_CGM_MUX_0_DC_4_DIV_MASK)

#define MC_CGM_MUX_0_DC_4_DE_MASK                (0x80000000U)
#define MC_CGM_MUX_0_DC_4_DE_SHIFT               (31U)
/*! DE - Divider enable
 *  0b0..Reserved
 *  0b1..Divider is enabled.
 */
#define MC_CGM_MUX_0_DC_4_DE(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DC_4_DE_SHIFT)) & MC_CGM_MUX_0_DC_4_DE_MASK)
/*! @} */

/*! @name MUX_0_DC_5 - Clock Mux 0 Divider 5 Control Register */
/*! @{ */

#define MC_CGM_MUX_0_DC_5_DIV_MASK               (0x70000U)
#define MC_CGM_MUX_0_DC_5_DIV_SHIFT              (16U)
/*! DIV - Division value */
#define MC_CGM_MUX_0_DC_5_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DC_5_DIV_SHIFT)) & MC_CGM_MUX_0_DC_5_DIV_MASK)

#define MC_CGM_MUX_0_DC_5_DE_MASK                (0x80000000U)
#define MC_CGM_MUX_0_DC_5_DE_SHIFT               (31U)
/*! DE - Divider enable
 *  0b0..Reserved
 *  0b1..Divider is enabled.
 */
#define MC_CGM_MUX_0_DC_5_DE(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DC_5_DE_SHIFT)) & MC_CGM_MUX_0_DC_5_DE_MASK)
/*! @} */

/*! @name MUX_0_DC_6 - Clock Mux 0 Divider 6 Control Register */
/*! @{ */

#define MC_CGM_MUX_0_DC_6_DIV_MASK               (0x70000U)
#define MC_CGM_MUX_0_DC_6_DIV_SHIFT              (16U)
/*! DIV - Division value */
#define MC_CGM_MUX_0_DC_6_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DC_6_DIV_SHIFT)) & MC_CGM_MUX_0_DC_6_DIV_MASK)

#define MC_CGM_MUX_0_DC_6_DE_MASK                (0x80000000U)
#define MC_CGM_MUX_0_DC_6_DE_SHIFT               (31U)
/*! DE - Divider enable
 *  0b0..Reserved
 *  0b1..Divider is enabled.
 */
#define MC_CGM_MUX_0_DC_6_DE(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DC_6_DE_SHIFT)) & MC_CGM_MUX_0_DC_6_DE_MASK)
/*! @} */

/*! @name MUX_0_DIV_TRIG_CTRL - Clock Mux 0 Divider Trigger Control Register */
/*! @{ */

#define MC_CGM_MUX_0_DIV_TRIG_CTRL_TCTL_MASK     (0x1U)
#define MC_CGM_MUX_0_DIV_TRIG_CTRL_TCTL_SHIFT    (0U)
/*! TCTL - Trigger control
 *  0b0..Immediate divider update
 *  0b1..Common trigger divider update
 */
#define MC_CGM_MUX_0_DIV_TRIG_CTRL_TCTL(x)       (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DIV_TRIG_CTRL_TCTL_SHIFT)) & MC_CGM_MUX_0_DIV_TRIG_CTRL_TCTL_MASK)

#define MC_CGM_MUX_0_DIV_TRIG_CTRL_HHEN_MASK     (0x80000000U)
#define MC_CGM_MUX_0_DIV_TRIG_CTRL_HHEN_SHIFT    (31U)
/*! HHEN - Halt handshake enable
 *  0b0..No halt handshake protocol is initiated.
 *  0b1..Halt handshake protocol is initiated.
 */
#define MC_CGM_MUX_0_DIV_TRIG_CTRL_HHEN(x)       (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DIV_TRIG_CTRL_HHEN_SHIFT)) & MC_CGM_MUX_0_DIV_TRIG_CTRL_HHEN_MASK)
/*! @} */

/*! @name MUX_0_DIV_TRIG - Clock Mux 0 Divider Trigger Register */
/*! @{ */

#define MC_CGM_MUX_0_DIV_TRIG_TRIGGER_MASK       (0xFFFFFFFFU)
#define MC_CGM_MUX_0_DIV_TRIG_TRIGGER_SHIFT      (0U)
/*! TRIGGER - Trigger for divider update */
#define MC_CGM_MUX_0_DIV_TRIG_TRIGGER(x)         (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_0_DIV_TRIG_TRIGGER_SHIFT)) & MC_CGM_MUX_0_DIV_TRIG_TRIGGER_MASK)
/*! @} */

/*! @name MUX_0_DIV_UPD_STAT - Clock Mux 0 Divider Update Status Register */
/*! @{ */

