zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MC_CGM.h
#define MC_CGM_MUX_5_CSS_GRIP_MASK               (0x10000U)
#define MC_CGM_MUX_5_CSS_GRIP_SHIFT              (16U)
/*! GRIP - Gating request is in progress.
 *  0b0..Clock source gating or ungating has completed.
 *  0b1..Clock source gating or ungating is in progress.
 */
#define MC_CGM_MUX_5_CSS_GRIP(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_5_CSS_GRIP_SHIFT)) & MC_CGM_MUX_5_CSS_GRIP_MASK)

#define MC_CGM_MUX_5_CSS_CS_MASK                 (0x20000U)
#define MC_CGM_MUX_5_CSS_CS_SHIFT                (17U)
/*! CS - Clock status
 *  0b0..Clock is gated to logic-0 at output of clock mux
 *  0b1..Clock mux is transparent. Active clock pulses at input of clock mux results in same number of pulses at its output
 */
#define MC_CGM_MUX_5_CSS_CS(x)                   (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_5_CSS_CS_SHIFT)) & MC_CGM_MUX_5_CSS_CS_MASK)

#define MC_CGM_MUX_5_CSS_SELSTAT_MASK            (0x3F000000U)
#define MC_CGM_MUX_5_CSS_SELSTAT_SHIFT           (24U)
/*! SELSTAT - Clock source selection status
 *  0b000000..FIRC
 *  0b000001..SIRC
 *  0b000010..FXOSC
 *  0b000100..SXOSC
 *  0b010111..AIPS_SLOW_CLK
 *  0b110010..Reserved
 */
#define MC_CGM_MUX_5_CSS_SELSTAT(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_5_CSS_SELSTAT_SHIFT)) & MC_CGM_MUX_5_CSS_SELSTAT_MASK)
/*! @} */

/*! @name MUX_5_DC_0 - Clock Mux 5 Divider 0 Control Register */
/*! @{ */

#define MC_CGM_MUX_5_DC_0_DIV_MASK               (0x70000U)
#define MC_CGM_MUX_5_DC_0_DIV_SHIFT              (16U)
/*! DIV - Division value */
#define MC_CGM_MUX_5_DC_0_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_5_DC_0_DIV_SHIFT)) & MC_CGM_MUX_5_DC_0_DIV_MASK)

#define MC_CGM_MUX_5_DC_0_DE_MASK                (0x80000000U)
#define MC_CGM_MUX_5_DC_0_DE_SHIFT               (31U)
/*! DE - Divider enable
 *  0b0..Divider is disabled.
 *  0b1..Divider is enabled.
 */
#define MC_CGM_MUX_5_DC_0_DE(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_5_DC_0_DE_SHIFT)) & MC_CGM_MUX_5_DC_0_DE_MASK)
/*! @} */

/*! @name MUX_5_DIV_UPD_STAT - Clock Mux 5 Divider Update Status Register */
/*! @{ */

#define MC_CGM_MUX_5_DIV_UPD_STAT_DIV_STAT_MASK  (0x1U)
#define MC_CGM_MUX_5_DIV_UPD_STAT_DIV_STAT_SHIFT (0U)
/*! DIV_STAT - Divider status for clock mux 5
 *  0b0..No divider configuration update is pending.
 *  0b1..Divider configuration update on at least one divider associated with this multiplexer is pending.
 */
#define MC_CGM_MUX_5_DIV_UPD_STAT_DIV_STAT(x)    (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_5_DIV_UPD_STAT_DIV_STAT_SHIFT)) & MC_CGM_MUX_5_DIV_UPD_STAT_DIV_STAT_MASK)
/*! @} */

/*! @name MUX_6_CSC - Clock Mux 6 Select Control Register */
/*! @{ */

#define MC_CGM_MUX_6_CSC_CG_MASK                 (0x4U)
#define MC_CGM_MUX_6_CSC_CG_SHIFT                (2U)
/*! CG - Clock gate */
#define MC_CGM_MUX_6_CSC_CG(x)                   (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_6_CSC_CG_SHIFT)) & MC_CGM_MUX_6_CSC_CG_MASK)

#define MC_CGM_MUX_6_CSC_FCG_MASK                (0x8U)
#define MC_CGM_MUX_6_CSC_FCG_SHIFT               (3U)
/*! FCG - Force clock gate */
#define MC_CGM_MUX_6_CSC_FCG(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_6_CSC_FCG_SHIFT)) & MC_CGM_MUX_6_CSC_FCG_MASK)

#define MC_CGM_MUX_6_CSC_SELCTL_MASK             (0x3F000000U)
#define MC_CGM_MUX_6_CSC_SELCTL_SHIFT            (24U)
/*! SELCTL - Clock source selection control
 *  0b000000..FIRC
 *  0b000001..SIRC
 *  0b000010..FXOSC
 *  0b000100..SXOSC
 *  0b001000..PLL_PHI0_CLK
 *  0b001001..PLL_PHI1_CLK
 *  0b010000..CORE_CLK
 *  0b010011..HSE_CLK
 *  0b010110..AIPS_PLAT_CLK
 *  0b010111..AIPS_SLOW_CLK
 *  0b011000..EMAC_RMII_TX_CLK
 *  0b011001..EMAC_RX_CLK
 *  0b110011..Reserved
 *  0b110100..Reserved
 *  0b110101..Reserved
 *  0b110110..Reserved
 *  0b110111..Reserved
 *  0b111000..Reserved
 *  0b111001..Reserved
 *  0b111010..Reserved
 *  0b111011..Reserved
 *  0b111100..Reserved
 *  0b111101..Reserved
 *  0b111110..Reserved
 */
#define MC_CGM_MUX_6_CSC_SELCTL(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_6_CSC_SELCTL_SHIFT)) & MC_CGM_MUX_6_CSC_SELCTL_MASK)
/*! @} */

/*! @name MUX_6_CSS - Clock Mux 6 Select Status Register */
/*! @{ */

#define MC_CGM_MUX_6_CSS_GRIP_MASK               (0x10000U)
#define MC_CGM_MUX_6_CSS_GRIP_SHIFT              (16U)
/*! GRIP - Gating request is in progress.
 *  0b0..Clock source gating or ungating has completed.
 *  0b1..Clock source gating or ungating is in progress.
 */
#define MC_CGM_MUX_6_CSS_GRIP(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_6_CSS_GRIP_SHIFT)) & MC_CGM_MUX_6_CSS_GRIP_MASK)

#define MC_CGM_MUX_6_CSS_CS_MASK                 (0x20000U)
#define MC_CGM_MUX_6_CSS_CS_SHIFT                (17U)
/*! CS - Clock status
 *  0b0..Clock is gated to logic-0 at output of clock mux
 *  0b1..Clock mux is transparent. Active clock pulses at input of clock mux results in same number of pulses at its output
 */
#define MC_CGM_MUX_6_CSS_CS(x)                   (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_6_CSS_CS_SHIFT)) & MC_CGM_MUX_6_CSS_CS_MASK)

#define MC_CGM_MUX_6_CSS_SELSTAT_MASK            (0x3F000000U)
#define MC_CGM_MUX_6_CSS_SELSTAT_SHIFT           (24U)
/*! SELSTAT - Clock source selection status
 *  0b000000..FIRC
 *  0b000001..SIRC
 *  0b000010..FXOSC
 *  0b000100..SXOSC
 *  0b001000..PLL_PHI0_CLK
 *  0b001001..PLL_PHI1_CLK
 *  0b010000..CORE_CLK
 *  0b010011..HSE_CLK
 *  0b010110..AIPS_PLAT_CLK
 *  0b010111..AIPS_SLOW_CLK
 *  0b011000..EMAC_RMII_TX_CLK
 *  0b011001..EMAC_RX_CLK
 *  0b110011..Reserved
 *  0b110100..Reserved
 *  0b110101..Reserved
 *  0b110110..Reserved
 *  0b110111..Reserved
 *  0b111000..Reserved
 *  0b111001..Reserved
 *  0b111010..Reserved
 *  0b111011..Reserved
 *  0b111100..Reserved
 *  0b111101..Reserved
 *  0b111110..Reserved
 */
#define MC_CGM_MUX_6_CSS_SELSTAT(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_6_CSS_SELSTAT_SHIFT)) & MC_CGM_MUX_6_CSS_SELSTAT_MASK)
/*! @} */

/*! @name MUX_6_DC_0 - Clock Mux 6 Divider 0 Control Register */
/*! @{ */

#define MC_CGM_MUX_6_DC_0_DIV_MASK               (0x3F0000U)
#define MC_CGM_MUX_6_DC_0_DIV_SHIFT              (16U)
/*! DIV - Division value */
#define MC_CGM_MUX_6_DC_0_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_6_DC_0_DIV_SHIFT)) & MC_CGM_MUX_6_DC_0_DIV_MASK)

