zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MC_CGM.h
#define MC_CGM_MUX_6_DC_0_DE_MASK                (0x80000000U)
#define MC_CGM_MUX_6_DC_0_DE_SHIFT               (31U)
/*! DE - Divider enable
 *  0b0..Divider is disabled.
 *  0b1..Divider is enabled.
 */
#define MC_CGM_MUX_6_DC_0_DE(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_6_DC_0_DE_SHIFT)) & MC_CGM_MUX_6_DC_0_DE_MASK)
/*! @} */

/*! @name MUX_6_DIV_UPD_STAT - Clock Mux 6 Divider Update Status Register */
/*! @{ */

#define MC_CGM_MUX_6_DIV_UPD_STAT_DIV_STAT_MASK  (0x1U)
#define MC_CGM_MUX_6_DIV_UPD_STAT_DIV_STAT_SHIFT (0U)
/*! DIV_STAT - Divider status for clock mux 6
 *  0b0..No divider configuration update is pending.
 *  0b1..Divider configuration update on at least one divider associated with this multiplexer is pending.
 */
#define MC_CGM_MUX_6_DIV_UPD_STAT_DIV_STAT(x)    (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_6_DIV_UPD_STAT_DIV_STAT_SHIFT)) & MC_CGM_MUX_6_DIV_UPD_STAT_DIV_STAT_MASK)
/*! @} */

/*! @name MUX_7_CSC - Clock Mux 7 Select Control Register */
/*! @{ */

#define MC_CGM_MUX_7_CSC_CLK_SW_MASK             (0x4U)
#define MC_CGM_MUX_7_CSC_CLK_SW_SHIFT            (2U)
/*! CLK_SW - Clock switch */
#define MC_CGM_MUX_7_CSC_CLK_SW(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_7_CSC_CLK_SW_SHIFT)) & MC_CGM_MUX_7_CSC_CLK_SW_MASK)

#define MC_CGM_MUX_7_CSC_SAFE_SW_MASK            (0x8U)
#define MC_CGM_MUX_7_CSC_SAFE_SW_SHIFT           (3U)
/*! SAFE_SW - Safe clock request */
#define MC_CGM_MUX_7_CSC_SAFE_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_7_CSC_SAFE_SW_SHIFT)) & MC_CGM_MUX_7_CSC_SAFE_SW_MASK)

#define MC_CGM_MUX_7_CSC_SELCTL_MASK             (0x1F000000U)
#define MC_CGM_MUX_7_CSC_SELCTL_SHIFT            (24U)
/*! SELCTL - Clock source selection control
 *  0b00000..FIRC
 *  0b11000..EMAC_RMII_TX_CLK
 *  0b11001..EMAC_RX_CLK
 */
#define MC_CGM_MUX_7_CSC_SELCTL(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_7_CSC_SELCTL_SHIFT)) & MC_CGM_MUX_7_CSC_SELCTL_MASK)
/*! @} */

/*! @name MUX_7_CSS - Clock Mux 7 Select Status Register */
/*! @{ */

#define MC_CGM_MUX_7_CSS_CLK_SW_MASK             (0x4U)
#define MC_CGM_MUX_7_CSS_CLK_SW_SHIFT            (2U)
/*! CLK_SW - Clock switch
 *  0b0..No clock switch operation was requested.
 *  0b1..Clock switch operation was requested.
 */
#define MC_CGM_MUX_7_CSS_CLK_SW(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_7_CSS_CLK_SW_SHIFT)) & MC_CGM_MUX_7_CSS_CLK_SW_MASK)

#define MC_CGM_MUX_7_CSS_SAFE_SW_MASK            (0x8U)
#define MC_CGM_MUX_7_CSS_SAFE_SW_SHIFT           (3U)
/*! SAFE_SW - Safe clock request
 *  0b0..No safe clock switch operation was requested.
 *  0b1..Safe clock switch operation was requested.
 */
#define MC_CGM_MUX_7_CSS_SAFE_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_7_CSS_SAFE_SW_SHIFT)) & MC_CGM_MUX_7_CSS_SAFE_SW_MASK)

#define MC_CGM_MUX_7_CSS_SWIP_MASK               (0x10000U)
#define MC_CGM_MUX_7_CSS_SWIP_SHIFT              (16U)
/*! SWIP - Switch in progress
 *  0b0..Clock source switching is complete.
 *  0b1..Clock source switching is in progress.
 */
#define MC_CGM_MUX_7_CSS_SWIP(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_7_CSS_SWIP_SHIFT)) & MC_CGM_MUX_7_CSS_SWIP_MASK)

#define MC_CGM_MUX_7_CSS_SWTRG_MASK              (0xE0000U)
#define MC_CGM_MUX_7_CSS_SWTRG_SHIFT             (17U)
/*! SWTRG - Switch trigger cause
 *  0b000..
 *  0b001..Switch after request succeeded.
 *  0b010..Switch after the request failed because of an inactive target clock and the current clock is FIRC.
 *  0b011..Switch after the request failed because of an inactive current clock and the current clock is FIRC.
 *  0b100..Switch to FIRC because of a safe clock request or reset succeeded.
 *  0b101..Switch to FIRC because of a safe clock request or reset succeeded, but the previous current clock source was inactive.
 *  0b110..
 *  0b111..
 */
#define MC_CGM_MUX_7_CSS_SWTRG(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_7_CSS_SWTRG_SHIFT)) & MC_CGM_MUX_7_CSS_SWTRG_MASK)

#define MC_CGM_MUX_7_CSS_SELSTAT_MASK            (0x1F000000U)
#define MC_CGM_MUX_7_CSS_SELSTAT_SHIFT           (24U)
/*! SELSTAT - Clock source selection status
 *  0b00000..FIRC
 *  0b11000..EMAC_RMII_TX_CLK
 *  0b11001..EMAC_RX_CLK
 */
#define MC_CGM_MUX_7_CSS_SELSTAT(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_7_CSS_SELSTAT_SHIFT)) & MC_CGM_MUX_7_CSS_SELSTAT_MASK)
/*! @} */

/*! @name MUX_7_DC_0 - Clock Mux 7 Divider 0 Control Register */
/*! @{ */

#define MC_CGM_MUX_7_DC_0_DIV_MASK               (0x3F0000U)
#define MC_CGM_MUX_7_DC_0_DIV_SHIFT              (16U)
/*! DIV - Division value */
#define MC_CGM_MUX_7_DC_0_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_7_DC_0_DIV_SHIFT)) & MC_CGM_MUX_7_DC_0_DIV_MASK)

#define MC_CGM_MUX_7_DC_0_DE_MASK                (0x80000000U)
#define MC_CGM_MUX_7_DC_0_DE_SHIFT               (31U)
/*! DE - Divider enable
 *  0b0..Divider is disabled.
 *  0b1..Divider is enabled.
 */
#define MC_CGM_MUX_7_DC_0_DE(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_7_DC_0_DE_SHIFT)) & MC_CGM_MUX_7_DC_0_DE_MASK)
/*! @} */

/*! @name MUX_7_DIV_UPD_STAT - Clock Mux 7 Divider Update Status Register */
/*! @{ */

#define MC_CGM_MUX_7_DIV_UPD_STAT_DIV_STAT_MASK  (0x1U)
#define MC_CGM_MUX_7_DIV_UPD_STAT_DIV_STAT_SHIFT (0U)
/*! DIV_STAT - Divider status for clock mux 7
 *  0b0..No divider configuration update is pending.
 *  0b1..Divider configuration update on at least one divider associated with this multiplexer is pending.
 */
#define MC_CGM_MUX_7_DIV_UPD_STAT_DIV_STAT(x)    (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_7_DIV_UPD_STAT_DIV_STAT_SHIFT)) & MC_CGM_MUX_7_DIV_UPD_STAT_DIV_STAT_MASK)
/*! @} */

/*! @name MUX_8_CSC - Clock Mux 8 Select Control Register */
/*! @{ */

#define MC_CGM_MUX_8_CSC_CLK_SW_MASK             (0x4U)
#define MC_CGM_MUX_8_CSC_CLK_SW_SHIFT            (2U)
/*! CLK_SW - Clock switch */
#define MC_CGM_MUX_8_CSC_CLK_SW(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_8_CSC_CLK_SW_SHIFT)) & MC_CGM_MUX_8_CSC_CLK_SW_MASK)

#define MC_CGM_MUX_8_CSC_SAFE_SW_MASK            (0x8U)
#define MC_CGM_MUX_8_CSC_SAFE_SW_SHIFT           (3U)
/*! SAFE_SW - Safe clock request */
#define MC_CGM_MUX_8_CSC_SAFE_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_8_CSC_SAFE_SW_SHIFT)) & MC_CGM_MUX_8_CSC_SAFE_SW_MASK)

#define MC_CGM_MUX_8_CSC_SELCTL_MASK             (0x1F000000U)
#define MC_CGM_MUX_8_CSC_SELCTL_SHIFT            (24U)
/*! SELCTL - Clock source selection control
 *  0b00000..FIRC
 *  0b11000..EMAC_RMII_TX_CLK
 */
#define MC_CGM_MUX_8_CSC_SELCTL(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_8_CSC_SELCTL_SHIFT)) & MC_CGM_MUX_8_CSC_SELCTL_MASK)
/*! @} */

